
&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере()
	Для Итератор = 1023 По 9876 Цикл
		Слово	= Формат(Итератор, "ЧГ=0");
		Напалм	= Новый Структура("Вариант,Число1,Число2,Число3,Число4", Лев(Слово, 1), Лев(Слово, 1));
		Для Буква = 2 По 4 Цикл
			Если СтрНайти(Напалм.Вариант, Сред(Слово, Буква, 1)) = 0 Тогда
				Напалм.Вариант	= Напалм.Вариант + Сред(Слово, Буква, 1);
				Напалм.Вставить("Число" + Формат(Буква, "ЧГ=0"), Сред(Слово, Буква, 1));
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если СтрДлина(Напалм.Вариант) = 4 Тогда
			НЗ = РегистрыСведений.Варианты.СоздатьНаборЗаписей();
			НЗ.Отбор.Вариант.Установить(Напалм.Вариант);
			НЗ.Прочитать();
			Если НЗ.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(НЗ.Добавить(), Напалм);
				НЗ.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьНаСервере()
	НЗ = РегистрыСведений.Варианты.СоздатьНаборЗаписей();
	НЗ.Очистить();
	НЗ.Записать();
КонецПроцедуры
